/*
 * common_errordef.h
 *
 *  Created on: 2011-11-21
 *      Author: jimm
 */

#ifndef COMMON_ERRORDEF_H_
#define COMMON_ERRORDEF_H_

/***************************************************************************************************
* 成功标识：	S_OK
*
* 成功描述：	调用成功
*/
#ifndef S_OK
#define S_OK													0x00000000
#endif


/***************************************************************************************************
* 成功标识：	S_FALSE
*
* 成功描述：	调用成功但执行不完全
*/
#ifndef S_FALSE
#define S_FALSE													0x00000001
#endif


/***************************************************************************************************
* 错误标识：	E_UNKNOWN
*
* 错误描述：	未知错误
*/
#define E_UNKNOWN												0x80000001


/***************************************************************************************************
* 错误标识：	E_NULLPOINTER
*
* 错误描述：	空指针错误
*/
#define E_NULLPOINTER											0x80000002


/***************************************************************************************************
* 错误标识：	E_INVALIDARGUMENT
*
* 错误描述：	无效的参数
*/
#define E_INVALIDARGUMENT										0x80000003

/***************************************************************************************************
* 错误标识：	E_CONNECTSERVER
*
* 错误描述：	连接服务器失败
*/
#define E_CONNECTSERVER											0x80000004


/***************************************************************************************************
* 错误标识：	E_SHMATTACH
*
* 错误描述：	无效的共享内存键值
*/
#define E_SHMATTACH												0x80010001


/***************************************************************************************************
* 错误标识：	E_SHMDELETE
*
* 错误描述：	共享内存删除失败
*/
#define E_SHMDELETE												0x80010002


/***************************************************************************************************
* 错误标识：	E_SOCKETCREATE
*
* 错误描述：	套接字创建失败
*/
#define E_SOCKETCREATE											0x80030001


/***************************************************************************************************
* 错误标识：	E_SOCKETOPTION
*
* 错误描述：	套接字选项设置失败
*/
#define E_SOCKETOPTION											0x80030002


/***************************************************************************************************
* 错误标识：	E_SOCKETBIND
*
* 错误描述：	套接字绑定失败
*/
#define E_SOCKETBIND											0x80030003


/***************************************************************************************************
* 错误标识：	E_SOCKETLISTEN
*
* 错误描述：	套接字监听失败
*/
#define E_SOCKETLISTEN											0x80030004


/***************************************************************************************************
* 错误标识：	E_REMOTEIP
*
* 错误描述：	无效的目的IP地址
*/
#define E_REMOTEIP												0x80030005


/***************************************************************************************************
* 错误标识：	E_SOCKETTYPE
*
* 错误描述：	套接字类型错误
*/
#define E_SOCKETTYPE											0x80030006


/***************************************************************************************************
* 错误标识：	E_SOCKETNOTCREATED
*
* 错误描述：	套接字未创建
*/
#define E_SOCKETNOTCREATED										0x80030007


/***************************************************************************************************
* 错误标识：	E_SOCKETCONNECT
*
* 错误描述：	套接字连接失败
*/
#define E_SOCKETCONNECT											0x80030008


/***************************************************************************************************
* 错误标识：	E_SOCKETACCEPT
*
* 错误描述：	套接字接受失败
*/
#define E_SOCKETACCEPT											0x80030009


/***************************************************************************************************
* 错误标识：	E_SOCKETCONTROL
*
* 错误描述：	套接字控制失败
*/
#define E_SOCKETCONTROL											0x8003000A


/***************************************************************************************************
* 错误标识：	S_NODATA
*
* 错误描述：	没有数据到达
*/
#define S_NODATA												0x00030001


/***************************************************************************************************
* 错误标识：	E_SOCKETDISCONNECTED
*
* 错误描述：	套接字已断开连接
*/
#define E_SOCKETDISCONNECTED									0x8003000B


/***************************************************************************************************
* 错误标识：	E_SOCKETERROR
*
* 错误描述：	套接字发生错误
*/
#define E_SOCKETERROR											0x8003000C


/***************************************************************************************************
* 错误标识：	S_SENDNOTCOMPLETED
*
* 错误描述：	数据未完全发送
*/
#define S_SENDNOTCOMPLETED										0x8003000D


/***************************************************************************************************
* 错误标识：	S_ALREADYCONNECTED
*
* 错误描述：	连接已经建立
*/
#define S_ALREADYCONNECTED										0x00030002


/***************************************************************************************************
* 错误标识：	E_MYSQLINIT
*
* 错误描述：	数据库初始化失败
*/
#define E_MYSQLINIT												0x80040001


/***************************************************************************************************
* 错误标识：	E_MYSQLOPTION
*
* 错误描述：	数据库选项设置失败
*/
#define E_MYSQLOPTION											0x80040002


/***************************************************************************************************
* 错误标识：	E_MYSQLCONNECT
*
* 错误描述：	数据库连接失败
*/
#define E_MYSQLCONNECT											0x80040003


/***************************************************************************************************
* 错误标识：	E_MYSQLINSERT
*
* 错误描述：	数据库插入操作执行失败
*/
#define E_MYSQLINSERT											0x80040004


/***************************************************************************************************
* 错误标识：	E_MYSQLUPDATE
*
* 错误描述：	数据库更新操作执行失败
*/
#define E_MYSQLUPDATE											0x80040005


/***************************************************************************************************
* 错误标识：	E_MYSQLDELETE
*
* 错误描述：	数据库删除操作执行失败
*/
#define E_MYSQLDELETE											0x80040006


/***************************************************************************************************
* 错误标识：	E_MYSQLQUERY
*
* 错误描述：	数据库查询操作执行失败
*/
#define E_MYSQLQUERY											0x80040007


/***************************************************************************************************
* 错误标识：	E_MYSQLSTORERESULT
*
* 错误描述：	保存数据库查询结果失败
*/
#define E_MYSQLSTORERESULT										0x80040008


/***************************************************************************************************
* 错误标识：	E_OBJECTNOTEXIST
*
* 错误描述：	对象不存在
*/
#define E_OBJECTNOTEXIST										0x80050001


/***************************************************************************************************
* 错误标识：	E_INVALIDOBJECTINDEX
*
* 错误描述：	无效的对象索引
*/
#define E_INVALIDOBJECTINDEX									0x80050002


/***************************************************************************************************
* 错误标识：	E_OBJECTINDEXNOTUSED
*
* 错误描述：	对象索引未被使用
*/
#define E_OBJECTINDEXNOTUSED									0x80050003


/***************************************************************************************************
* 错误标识：	E_OBJECTPOOLISFULL
*
* 错误描述：	对象池已满
*/
#define E_OBJECTPOOLISFULL										0x80050004


/***************************************************************************************************
* 错误标识：	E_OBJECTEXIST
*
* 错误描述：	对象池已存在
*/
#define E_OBJECTEXIST											0x80050005


/***************************************************************************************************
* 错误标识：	E_DECODEBUFLENGTH
*
* 错误描述：	数据编码缓冲区溢出
*/
#define E_ENCODEBUFLENGTH										0x80060001


/***************************************************************************************************
* 错误标识：	E_DECODEBUFLENGTH
*
* 错误描述：	数据解码缓冲区溢出
*/
#define E_DECODEBUFLENGTH										0x80060002


/***************************************************************************************************
* 错误标识：	E_MAXLENGTH
*
* 错误描述：	数据长度超出范围
*/
#define E_MAXLENGTH												0x80060003


/***************************************************************************************************
* 错误标识：	E_MAXCOUNT
*
* 错误描述：	数量超出范围
*/
#define E_MAXCOUNT												0x80060004


/***************************************************************************************************
* 错误标识：	E_INVALIDSTRINGLENGTH
*
* 错误描述：	无效的字符串长度
*/
#define E_INVALIDSTRINGLENGTH									0x80060005


/***************************************************************************************************
* 错误标识：	E_QUEUENOTINITIALIZED
*
* 错误描述：	队列没有初始化
*/
#define E_QUEUENOTINITIALIZED									0x80070001


/***************************************************************************************************
* 错误标识：	E_FULLQUEUE
*
* 错误描述：	队列已满
*/
#define E_FULLQUEUE												0x80070002


/***************************************************************************************************
* 错误标识：	E_QUEUESHATTERED
*
* 错误描述：	队列已损坏
*/
#define E_QUEUESHATTERED										0x80070003


/***************************************************************************************************
* 错误标识：	E_SPACENOTENOUGH
*
* 错误描述：	队列空间不够
*/
#define E_SPACENOTENOUGH										0x80070004


/***************************************************************************************************
* 错误标识：	E_EMPTYQUEUE
*
* 错误描述：	队列为空
*/
#define E_EMPTYQUEUE											0x80070005


/***************************************************************************************************
* 错误标识：	E_INVALIDPACKAGE
*
* 错误描述：	队列中存在无效的数据包
*/
#define E_INVALIDPACKAGE										0x80070006


/***************************************************************************************************
* 错误标识：	E_INVALIDHEAD
*
* 错误描述：	无效的队列头
*/
#define E_INVALIDHEAD											0x80070007


/***************************************************************************************************
* 错误标识：	E_INVALIDTAIL
*
* 错误描述：	无效的队列尾
*/
#define E_INVALIDTAIL											0x80070008

/***************************************************************************************************
* 错误标识：	E_SETITEMNOTEXIST
*
* 错误描述：	集合元素不存在
*/
#define E_SETITEMNOTEXIST										0x80080001
/***************************************************************************************************
* 错误标识：	E_SETITEMEXIST
*
* 错误描述：	集合元素已存在
*/
#define E_SETITEMEXIST											0x80080002

/***************************************************************************************************
* 错误标识：	E_SETOUTOFCAPACITY
*
* 错误描述：	超出集合容量
*/
#define E_SETOUTOFCAPACITY										0x80080003

/***************************************************************************************************
* 错误标识：	E_SETISFULL
*
* 错误描述：	集合容量到达上限
*/
#define E_SETISFULL												0x80080004

/***************************************************************************************************
* 错误标识：	E_AGAIN
*
* 错误描述：	系统被中断
*/
#define E_AGAIN												0x80080005

/***************************************************************************************************
* 错误标识：	E_TIMEOUT
*
* 错误描述：	操作超时
*/
#define E_TIMEOUT												0x80080006

/***************************************************************************************************
* 错误标识：	E_INSTALLTIMERFAILED
*
* 错误描述：	注册定时器超时
*/
#define E_INSTALLTIMERFAILED							0x80080007


/***************************************************************************************************
* 错误标识：	E_DMZ_ENCODE
*
* 错误描述：	DMZ数据包编码失败
*/
#define E_DMZ_ENCODE							0x80080008


/***************************************************************************************************
* 错误标识：	E_DMZ_DECODE
*
* 错误描述：	DMZ数据包解码失败
*/
#define E_DMZ_DECODE							0x80080009


/***************************************************************************************************
* 错误标识：	E_BASE64_FLOW
*
* 错误描述：	base64数据包编解码目标缓冲区大小不够
*/
#define E_BASE64_FLOW						0x8008000A

/***************************************************************************************************
* 错误标识：	E_BASE64_INVALIDCHAR
*
* 错误描述：	base64数据包解码时遇到非法字符
*/
#define E_BASE64_INVALIDCHAR						0x8008000B

/***************************************************************************************************
* 错误标识：	E_BASE64_INVALIDCHAR
*
* 错误描述：	base64数据包解码时遇到非法源长度
*/
#define E_BASE64_INVALIDLEN						0x8008000C

/***************************************************************************************************
* 错误标识：	E_SQL_FORMATFLOW
*
* 错误描述：	格式化sql语句的时候缓冲区溢出
*/
#define E_SQL_FORMATFLOW							0x8008000C


/***************************************************************************************************
* 错误标识：	E_SQL_QUERYFLOW
*
* 错误描述：	格式化sql语句的时候缓冲区溢出
*/
#define E_SQL_QUERYFLOW								0x8008000D

/***************************************************************************************************
* 错误标识：	E_SOCKET_CONNECTING
*
* 错误描述：	套接字正在连接
*/
#define E_SOCKET_CONNECTING							0x8008000E

/***************************************************************************************************
* 错误标识：	E_INVALID_ARGUMENTS
*
* 错误描述：	非法参数
*/
#define E_INVALID_ARGUMENTS							0x8008000F

/***************************************************************************************************
* 错误标识：	E_INVALID_DBINDEX
*
* 错误描述：	非法DB索引下标
*/
#define E_INVALID_DBINDEX							0x80080010

/***************************************************************************************************
* 错误标识：	E_NOTFOUND
*
* 错误描述：	没有找到指定值
*/
#define E_NOTFOUND									0x80080011

/***************************************************************************************************
* 错误标识：	E_DB_NORECORDS
*
* 错误描述：	没有找到数据库记录
*/
#define E_DB_NORECORDS								0x80080012


/***************************************************************************************************
* 错误标识：	E_CREATECACHEOBJECT
*
* 错误描述：	创建Cache对象失败
*/
#define E_CREATECACHEOBJECT								0x80090001

/***************************************************************************************************
* 错误标识：	E_CREATECACHEOBJECTINDEX
*
* 错误描述：	创建Cache对象索引失败
*/
#define E_CREATECACHEOBJECTINDEX						0x80090002

/***************************************************************************************************
* 错误标识：	E_CACHEOBJECTNOTFOUND
*
* 错误描述：	找不到Cache对象
*/
#define E_CACHEOBJECTNOTFOUND							0x80090003

/***************************************************************************************************
* 错误标识：	E_CACHEOBJECTNOTEXIST
*
* 错误描述：	Cache对象不存在
*/
#define E_CACHEOBJECTNOTEXIST							0x80090004

/***************************************************************************************************
* 错误标识：	E_CACHEOBJECTACTIVESTATE
*
* 错误描述：	Cache对象活跃状态错误
*/
#define E_CACHEOBJECTACTIVESTATE						0x80090005

/***************************************************************************************************
* 错误标识：	E_CACHECREATEOBJECTINDEX
*
* 错误描述：	活跃Cache对象数量为零
*/
#define E_CACHECREATEOBJECTINDEX						0x80090006

/***************************************************************************************************
* 错误标识：	E_NOTINACTIVE
*
* 错误描述：	对象不处于非活跃状态
*/
#define E_NOTINACTIVE									0x80090007

/***************************************************************************************************
* 错误标识：	E_INACTIVEISFULL
*
* 错误描述：	非活跃状态对象链已满
*/
#define E_INACTIVEISFULL								0x80090008

/***************************************************************************************************
* 错误标识：	E_ACTIVEISFULL
*
* 错误描述：	活跃状态对象链已满
*/
#define E_ACTIVEISFULL									0x80090009

/***************************************************************************************************
* 错误标识：	E_ACTIVESTATE
*
* 错误描述：	活跃状态不匹配
*/
#define E_ACTIVESTATE									0x8009000A
/***************************************************************************************************
* 错误标识：	E_NOTQUANTIFIED
*
* 错误描述：	权限不够
*/
#define E_NOTQUANTIFIED									0x8009000B

/***************************************************************************************************
* 错误标识：	E_SESSIONTYPE_NOTMATCH
*
* 错误描述：	会话类型不匹配
*/
#define E_SESSIONTYPE_NOTMATCH							0x8009000C

/***************************************************************************************************
* 错误标识：	E_ROLEID_NOTMATCH
*
* 错误描述：	玩家ID不匹配
*/
#define E_ROLEID_NOTMATCH								0x8009000D

/***************************************************************************************************
* 错误标示： E_SET_MYSQL_CHARSET
* 
* 错误描述： 设置mysql字符集失败
*/
#define E_SET_MYSQL_CHARSET                             0x8009000E

#endif /* COMMON_ERRORDEF_H_ */
