/*
 * common_errordef.h
 *
 *  Created on: 2013年12月19日
 *      Author: jimm
 */

#ifndef COMMON_ERRORDEF_H_
#define COMMON_ERRORDEF_H_

/***************************************************************************************************
* 成功标识：	S_OK
*
* 成功描述：	调用成功
*/
#ifndef S_OK
#define S_OK													0x00000000
#endif


/***************************************************************************************************
* 成功标识：	S_FALSE
*
* 成功描述：	调用成功但执行不完全
*/
#ifndef S_FALSE
#define S_FALSE													0x00000001
#endif


/***************************************************************************************************
* 错误标识：	E_UNKNOWN
*
* 错误描述：	未知错误
*/
#define E_UNKNOWN												0x80000001


/***************************************************************************************************
* 错误标识：	E_NULLPOINTER
*
* 错误描述：	空指针错误
*/
#define E_NULLPOINTER											0x80000002


/***************************************************************************************************
* 错误标识：	E_INVALIDARGUMENT
*
* 错误描述：	无效的参数
*/
#define E_INVALIDARGUMENT										0x80000003

/***************************************************************************************************
* 错误标识：	E_DECODEBUFLENGTH
*
* 错误描述：	数据编码缓冲区溢出
*/
#define E_ENCODEBUFLENGTH										0x80000004


/***************************************************************************************************
* 错误标识：	E_DECODEBUFLENGTH
*
* 错误描述：	数据解码缓冲区溢出
*/
#define E_DECODEBUFLENGTH										0x80000005


/***************************************************************************************************
* 错误标识：	E_MAXLENGTH
*
* 错误描述：	数据长度超出范围
*/
#define E_MAXLENGTH												0x80000006


/***************************************************************************************************
* 错误标识：	E_MALLOCFAILED
*
* 错误描述：	分配内存失败
*/
#define E_MALLOCFAILED											0x80000007


/***************************************************************************************************
* 错误标识：	E_CREATEOBJECT
*
* 错误描述：	创建对象失败
*/
#define E_CREATEOBJECT											0x80000008


/***************************************************************************************************
* 错误标识：	E_GTEOBJECT
*
* 错误描述：	获取对象失败
*/
#define E_GTEOBJECT												0x80000009


/***************************************************************************************************
* 错误标识：	E_INSERTMAP
*
* 错误描述：	插入map失败
*/
#define E_INSERTMAP												0x8000000a


/***************************************************************************************************
* 错误标识：	E_INVALIDOBJECTINDEX
*
* 错误描述：	无效的对象索引
*/
#define E_INVALIDOBJECTINDEX									0x8000000b


/***************************************************************************************************
* 错误标识：	E_OBJECTINDEXNOTUSED
*
* 错误描述：	对象索引未被使用
*/
#define E_OBJECTINDEXNOTUSED									0x8000000c


#endif /* COMMON_ERRORDEF_H_ */
